; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city3)
	(fuel-level plane1 fl3)
	(at plane2 city2)
	(fuel-level plane2 fl2)
	(at plane3 city3)
	(fuel-level plane3 fl3)
	(at person1 city12)
	(at person2 city12)
	(at person3 city17)
	(at person4 city1)
	(at person5 city1)
	(at person6 city13)
	(at person7 city6)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city13)
	(at person2 city8)
	(at person3 city13)
	(at person4 city3)
	(at person5 city10)
	(at person6 city4)
	(at person7 city15)
	))

)

; plan
1. (zoom plane1 city3 city1 fl3 fl2 fl1)
   deleted: (at plane1 city3) (fuel-level plane1 fl3)
   added: (at plane1 city1) (fuel-level plane1 fl1)
   goals met: 0 of 7
2. (board person5 plane1 city1)
   deleted: (at person5 city1)
   added: (in person5 plane1)
   goals met: 0 of 7
3. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   goals met: 0 of 7
4. (fly plane1 city1 city10 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city10) (fuel-level plane1 fl0)
   goals met: 0 of 7
5. (refuel plane1 city10 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 0 of 7
6. (debark person5 plane1 city10)
   deleted: (in person5 plane1)
   added: (at person5 city10)
   goals met: 1 of 7
7. (fly plane1 city10 city3 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 1 of 7
8. (debark person4 plane1 city3)
   deleted: (in person4 plane1)
   added: (at person4 city3)
   goals met: 2 of 7
9. (zoom plane2 city2 city12 fl2 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl2)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 2 of 7
10. (zoom plane3 city3 city13 fl3 fl2 fl1)
   deleted: (at plane3 city3) (fuel-level plane3 fl3)
   added: (at plane3 city13) (fuel-level plane3 fl1)
   goals met: 2 of 7
11. (board person6 plane3 city13)
   deleted: (at person6 city13)
   added: (in person6 plane3)
   goals met: 2 of 7
12. (board person2 plane2 city12)
   deleted: (at person2 city12)
   added: (in person2 plane2)
   goals met: 2 of 7
13. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 2 of 7
14. (board person1 plane2 city12)
   deleted: (at person1 city12)
   added: (in person1 plane2)
   goals met: 2 of 7
15. (fly plane2 city12 city13 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city13) (fuel-level plane2 fl0)
   goals met: 2 of 7
16. (refuel plane2 city13 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 2 of 7
17. (fly plane3 city13 city4 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 2 of 7
18. (debark person6 plane3 city4)
   deleted: (in person6 plane3)
   added: (at person6 city4)
   goals met: 3 of 7
19. (debark person1 plane2 city13)
   deleted: (in person1 plane2)
   added: (at person1 city13)
   goals met: 4 of 7
20. (fly plane2 city13 city17 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city17) (fuel-level plane2 fl0)
   goals met: 4 of 7
21. (refuel plane2 city17 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 4 of 7
22. (board person3 plane2 city17)
   deleted: (at person3 city17)
   added: (in person3 plane2)
   goals met: 4 of 7
23. (fly plane2 city17 city13 fl1 fl0)
   deleted: (at plane2 city17) (fuel-level plane2 fl1)
   added: (at plane2 city13) (fuel-level plane2 fl0)
   goals met: 4 of 7
24. (refuel plane2 city13 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 4 of 7
25. (debark person3 plane2 city13)
   deleted: (in person3 plane2)
   added: (at person3 city13)
   goals met: 5 of 7
26. (fly plane2 city13 city6 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 5 of 7
27. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 7
28. (board person7 plane2 city6)
   deleted: (at person7 city6)
   added: (in person7 plane2)
   goals met: 5 of 7
29. (fly plane2 city6 city15 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 5 of 7
30. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 7
31. (debark person7 plane2 city15)
   deleted: (in person7 plane2)
   added: (at person7 city15)
   goals met: 6 of 7
32. (fly plane2 city15 city8 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 6 of 7
33. (debark person2 plane2 city8)
   deleted: (in person2 plane2)
   added: (at person2 city8)
   goals met: 7 of 7
